Revit 2027 API
RebarBendingDetailType.SegmentLengthsDisplayOption Property
 Identifies if the segment lengths are represented using dimensions or just as text.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public BendingDetailSegmentLengthsDisplayOptions SegmentLengthsDisplayOption { get; set; }
Public Property SegmentLengthsDisplayOption As BendingDetailSegmentLengthsDisplayOptions
	Get
	Set
public:
property BendingDetailSegmentLengthsDisplayOptions SegmentLengthsDisplayOption {
	BendingDetailSegmentLengthsDisplayOptions get ();
	void set (BendingDetailSegmentLengthsDisplayOptions value);
}
member SegmentLengthsDisplayOption : BendingDetailSegmentLengthsDisplayOptions with get, set
Property Value
BendingDetailSegmentLengthsDisplayOptions
Exceptions
Exception | Condition
ArgumentOutOfRangeException |  When setting this property: A value passed for an enumeration argument is not a member of that enumeration
See Also
Reference
RebarBendingDetailType Class
Autodesk.Revit.DB.Structure Namespace